name: "MOBILENETV2"

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    scale: 0.017
    mean_value: 103.52
    mean_value: 116.28
    mean_value: 123.675
  }
  data_param {
    source: "ilsvrc12_val_lmdb"
    batch_size: 25
    backend: LMDB
  }
}


#### small mobiletnetv2 ####

layer {
  name: "conv1_new_1by2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    engine: CAFFE
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv1_new_1by2"
  top: "conv1_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv1/scale_new_1by2"
  type: "Scale"
  bottom: "conv1_new_1by2"
  top: "conv1_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu1_new_1by2"
  type: "ReLU"
  bottom: "conv1_new_1by2"
  top: "conv1_new_1by2"
}

##################################################################

layer {
  name: "conv1_1/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv1_new_1by2"
  top: "conv1_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1_1/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv1_1/in/pw_new_1by2"
  top: "conv1_1/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv1_1/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv1_1/in/pw_new_1by2"
  top: "conv1_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu1_1/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv1_1/in/pw_new_1by2"
  top: "conv1_1/in/pw_new_1by2"
}
layer {
  name: "conv1_1/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv1_1/in/pw_new_1by2"
  top: "conv1_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1_1/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv1_1/dw_new_1by2"
  top: "conv1_1/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv1_1/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv1_1/dw_new_1by2"
  top: "conv1_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu1_1/dw_new_1by2"
  type: "ReLU"
  bottom: "conv1_1/dw_new_1by2"
  top: "conv1_1/dw_new_1by2"
}
layer {
  name: "conv1_1/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv1_1/dw_new_1by2"
  top: "conv1_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 8
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1_1/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv1_1/out/pw_new_1by2"
  top: "conv1_1/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv1_1/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv1_1/out/pw_new_1by2"
  top: "conv1_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
##################################################################
layer {
  name: "conv2_1/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv1_1/out/pw_new_1by2"
  top: "conv2_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_1/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv2_1/in/pw_new_1by2"
  top: "conv2_1/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv2_1/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv2_1/in/pw_new_1by2"
  top: "conv2_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu2_1/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv2_1/in/pw_new_1by2"
  top: "conv2_1/in/pw_new_1by2"
}
layer {
  name: "conv2_1/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv2_1/in/pw_new_1by2"
  top: "conv2_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_1/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv2_1/dw_new_1by2"
  top: "conv2_1/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv2_1/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv2_1/dw_new_1by2"
  top: "conv2_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu2_1/dw_new_1by2"
  type: "ReLU"
  bottom: "conv2_1/dw_new_1by2"
  top: "conv2_1/dw_new_1by2"
}
layer {
  name: "conv2_1/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv2_1/dw_new_1by2"
  top: "conv2_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 12
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_1/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv2_1/out/pw_new_1by2"
  top: "conv2_1/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv2_1/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv2_1/out/pw_new_1by2"
  top: "conv2_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "conv2_2/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv2_1/out/pw_new_1by2"
  top: "conv2_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 72
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_2/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv2_2/in/pw_new_1by2"
  top: "conv2_2/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv2_2/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv2_2/in/pw_new_1by2"
  top: "conv2_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu2_2/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv2_2/in/pw_new_1by2"
  top: "conv2_2/in/pw_new_1by2"
}
layer {
  name: "conv2_2/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv2_2/in/pw_new_1by2"
  top: "conv2_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 72
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_2/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv2_2/dw_new_1by2"
  top: "conv2_2/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv2_2/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv2_2/dw_new_1by2"
  top: "conv2_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu2_2/dw_new_1by2"
  type: "ReLU"
  bottom: "conv2_2/dw_new_1by2"
  top: "conv2_2/dw_new_1by2"
}
layer {
  name: "conv2_2/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv2_2/dw_new_1by2"
  top: "conv2_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 12
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_2/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv2_2/out/pw_new_1by2"
  top: "conv2_2/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv2_2/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv2_2/out/pw_new_1by2"
  top: "conv2_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv2_2_new_1by2"
  type: "Eltwise"
  bottom: "conv2_1/out/pw_new_1by2"
  bottom: "conv2_2/out/pw_new_1by2"
  top: "fuse_conv2_2_new_1by2"
  eltwise_param {
    operation: SUM
  }
}
###############################################

layer {
  name: "conv3_1/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv2_2_new_1by2"
  top: "conv3_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 72
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_1/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_1/in/pw_new_1by2"
  top: "conv3_1/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_1/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_1/in/pw_new_1by2"
  top: "conv3_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu3_1/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv3_1/in/pw_new_1by2"
  top: "conv3_1/in/pw_new_1by2"
}
layer {
  name: "conv3_1/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv3_1/in/pw_new_1by2"
  top: "conv3_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 72
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_1/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_1/dw_new_1by2"
  top: "conv3_1/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_1/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_1/dw_new_1by2"
  top: "conv3_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu3_1/dw_new_1by2"
  type: "ReLU"
  bottom: "conv3_1/dw_new_1by2"
  top: "conv3_1/dw_new_1by2"
}
layer {
  name: "conv3_1/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv3_1/dw_new_1by2"
  top: "conv3_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_1/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_1/out/pw_new_1by2"
  top: "conv3_1/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_1/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_1/out/pw_new_1by2"
  top: "conv3_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "conv3_2/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv3_1/out/pw_new_1by2"
  top: "conv3_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_2/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_2/in/pw_new_1by2"
  top: "conv3_2/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_2/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_2/in/pw_new_1by2"
  top: "conv3_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu3_2/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv3_2/in/pw_new_1by2"
  top: "conv3_2/in/pw_new_1by2"
}
layer {
  name: "conv3_2/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv3_2/in/pw_new_1by2"
  top: "conv3_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_2/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_2/dw_new_1by2"
  top: "conv3_2/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_2/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_2/dw_new_1by2"
  top: "conv3_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu3_2/dw_new_1by2"
  type: "ReLU"
  bottom: "conv3_2/dw_new_1by2"
  top: "conv3_2/dw_new_1by2"
}
layer {
  name: "conv3_2/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv3_2/dw_new_1by2"
  top: "conv3_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_2/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_2/out/pw_new_1by2"
  top: "conv3_2/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_2/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_2/out/pw_new_1by2"
  top: "conv3_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv3_2_new_1by2"
  type: "Eltwise"
  bottom: "conv3_1/out/pw_new_1by2"
  bottom: "conv3_2/out/pw_new_1by2"
  top: "fuse_conv3_2_new_1by2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_3/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv3_2_new_1by2"
  top: "conv3_3/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_3/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_3/in/pw_new_1by2"
  top: "conv3_3/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_3/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_3/in/pw_new_1by2"
  top: "conv3_3/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu3_3/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv3_3/in/pw_new_1by2"
  top: "conv3_3/in/pw_new_1by2"
}
layer {
  name: "conv3_3/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv3_3/in/pw_new_1by2"
  top: "conv3_3/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_3/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_3/dw_new_1by2"
  top: "conv3_3/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_3/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_3/dw_new_1by2"
  top: "conv3_3/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu3_3/dw_new_1by2"
  type: "ReLU"
  bottom: "conv3_3/dw_new_1by2"
  top: "conv3_3/dw_new_1by2"
}
layer {
  name: "conv3_3/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv3_3/dw_new_1by2"
  top: "conv3_3/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_3/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv3_3/out/pw_new_1by2"
  top: "conv3_3/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv3_3/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv3_3/out/pw_new_1by2"
  top: "conv3_3/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv3_3_new_1by2"
  type: "Eltwise"
  bottom: "fuse_conv3_2_new_1by2"
  bottom: "conv3_3/out/pw_new_1by2"
  top: "fuse_conv3_3_new_1by2"
  eltwise_param {
    operation: SUM
  }
}

###############################################

layer {
  name: "conv4_1/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv3_3_new_1by2"
  top: "conv4_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_1/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_1/in/pw_new_1by2"
  top: "conv4_1/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_1/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_1/in/pw_new_1by2"
  top: "conv4_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_1/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv4_1/in/pw_new_1by2"
  top: "conv4_1/in/pw_new_1by2"
}
layer {
  name: "conv4_1/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv4_1/in/pw_new_1by2"
  top: "conv4_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_1/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_1/dw_new_1by2"
  top: "conv4_1/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_1/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_1/dw_new_1by2"
  top: "conv4_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_1/dw_new_1by2"
  type: "ReLU"
  bottom: "conv4_1/dw_new_1by2"
  top: "conv4_1/dw_new_1by2"
}
layer {
  name: "conv4_1/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv4_1/dw_new_1by2"
  top: "conv4_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_1/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_1/out/pw_new_1by2"
  top: "conv4_1/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_1/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_1/out/pw_new_1by2"
  top: "conv4_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "conv4_2/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv4_1/out/pw_new_1by2"
  top: "conv4_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_2/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_2/in/pw_new_1by2"
  top: "conv4_2/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_2/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_2/in/pw_new_1by2"
  top: "conv4_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_2/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv4_2/in/pw_new_1by2"
  top: "conv4_2/in/pw_new_1by2"
}
layer {
  name: "conv4_2/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv4_2/in/pw_new_1by2"
  top: "conv4_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_2/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_2/dw_new_1by2"
  top: "conv4_2/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_2/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_2/dw_new_1by2"
  top: "conv4_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_2/dw_new_1by2"
  type: "ReLU"
  bottom: "conv4_2/dw_new_1by2"
  top: "conv4_2/dw_new_1by2"
}
layer {
  name: "conv4_2/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv4_2/dw_new_1by2"
  top: "conv4_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_2/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_2/out/pw_new_1by2"
  top: "conv4_2/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_2/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_2/out/pw_new_1by2"
  top: "conv4_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv4_2_new_1by2"
  type: "Eltwise"
  bottom: "conv4_1/out/pw_new_1by2"
  bottom: "conv4_2/out/pw_new_1by2"
  top: "fuse_conv4_2_new_1by2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_3/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv4_2_new_1by2"
  top: "conv4_3/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_3/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_3/in/pw_new_1by2"
  top: "conv4_3/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_3/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_3/in/pw_new_1by2"
  top: "conv4_3/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_3/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv4_3/in/pw_new_1by2"
  top: "conv4_3/in/pw_new_1by2"
}
layer {
  name: "conv4_3/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv4_3/in/pw_new_1by2"
  top: "conv4_3/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_3/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_3/dw_new_1by2"
  top: "conv4_3/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_3/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_3/dw_new_1by2"
  top: "conv4_3/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_3/dw_new_1by2"
  type: "ReLU"
  bottom: "conv4_3/dw_new_1by2"
  top: "conv4_3/dw_new_1by2"
}
layer {
  name: "conv4_3/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv4_3/dw_new_1by2"
  top: "conv4_3/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_3/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_3/out/pw_new_1by2"
  top: "conv4_3/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_3/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_3/out/pw_new_1by2"
  top: "conv4_3/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv4_3_new_1by2"
  type: "Eltwise"
  bottom: "fuse_conv4_2_new_1by2"
  bottom: "conv4_3/out/pw_new_1by2"
  top: "fuse_conv4_3_new_1by2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_4/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv4_3_new_1by2"
  top: "conv4_4/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_4/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_4/in/pw_new_1by2"
  top: "conv4_4/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_4/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_4/in/pw_new_1by2"
  top: "conv4_4/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_4/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv4_4/in/pw_new_1by2"
  top: "conv4_4/in/pw_new_1by2"
}
layer {
  name: "conv4_4/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv4_4/in/pw_new_1by2"
  top: "conv4_4/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_4/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_4/dw_new_1by2"
  top: "conv4_4/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_4/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_4/dw_new_1by2"
  top: "conv4_4/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu4_4/dw_new_1by2"
  type: "ReLU"
  bottom: "conv4_4/dw_new_1by2"
  top: "conv4_4/dw_new_1by2"
}
layer {
  name: "conv4_4/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv4_4/dw_new_1by2"
  top: "conv4_4/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_4/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv4_4/out/pw_new_1by2"
  top: "conv4_4/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv4_4/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv4_4/out/pw_new_1by2"
  top: "conv4_4/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv4_4_new_1by2"
  type: "Eltwise"
  bottom: "fuse_conv4_3_new_1by2"
  bottom: "conv4_4/out/pw_new_1by2"
  top: "fuse_conv4_4_new_1by2"
  eltwise_param {
    operation: SUM
  }
}

###############################################

layer {
  name: "conv5_1/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv4_4_new_1by2"
  top: "conv5_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_1/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_1/in/pw_new_1by2"
  top: "conv5_1/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_1/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_1/in/pw_new_1by2"
  top: "conv5_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu5_1/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv5_1/in/pw_new_1by2"
  top: "conv5_1/in/pw_new_1by2"
}
layer {
  name: "conv5_1/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv5_1/in/pw_new_1by2"
  top: "conv5_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_1/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_1/dw_new_1by2"
  top: "conv5_1/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_1/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_1/dw_new_1by2"
  top: "conv5_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu5_1/dw_new_1by2"
  type: "ReLU"
  bottom: "conv5_1/dw_new_1by2"
  top: "conv5_1/dw_new_1by2"
}
layer {
  name: "conv5_1/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv5_1/dw_new_1by2"
  top: "conv5_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_1/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_1/out/pw_new_1by2"
  top: "conv5_1/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_1/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_1/out/pw_new_1by2"
  top: "conv5_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "conv5_2/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv5_1/out/pw_new_1by2"
  top: "conv5_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_2/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_2/in/pw_new_1by2"
  top: "conv5_2/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_2/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_2/in/pw_new_1by2"
  top: "conv5_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu5_2/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv5_2/in/pw_new_1by2"
  top: "conv5_2/in/pw_new_1by2"
}
layer {
  name: "conv5_2/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv5_2/in/pw_new_1by2"
  top: "conv5_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_2/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_2/dw_new_1by2"
  top: "conv5_2/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_2/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_2/dw_new_1by2"
  top: "conv5_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu5_2/dw_new_1by2"
  type: "ReLU"
  bottom: "conv5_2/dw_new_1by2"
  top: "conv5_2/dw_new_1by2"
}
layer {
  name: "conv5_2/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv5_2/dw_new_1by2"
  top: "conv5_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_2/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_2/out/pw_new_1by2"
  top: "conv5_2/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_2/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_2/out/pw_new_1by2"
  top: "conv5_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv5_2_new_1by2"
  type: "Eltwise"
  bottom: "conv5_1/out/pw_new_1by2"
  bottom: "conv5_2/out/pw_new_1by2"
  top: "fuse_conv5_2_new_1by2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv5_3/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv5_2_new_1by2"
  top: "conv5_3/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_3/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_3/in/pw_new_1by2"
  top: "conv5_3/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_3/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_3/in/pw_new_1by2"
  top: "conv5_3/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu5_3/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv5_3/in/pw_new_1by2"
  top: "conv5_3/in/pw_new_1by2"
}
layer {
  name: "conv5_3/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv5_3/in/pw_new_1by2"
  top: "conv5_3/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_3/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_3/dw_new_1by2"
  top: "conv5_3/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_3/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_3/dw_new_1by2"
  top: "conv5_3/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu5_3/dw_new_1by2"
  type: "ReLU"
  bottom: "conv5_3/dw_new_1by2"
  top: "conv5_3/dw_new_1by2"
}
layer {
  name: "conv5_3/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv5_3/dw_new_1by2"
  top: "conv5_3/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv5_3/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv5_3/out/pw_new_1by2"
  top: "conv5_3/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv5_3/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv5_3/out/pw_new_1by2"
  top: "conv5_3/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "fuse_conv5_3_new_1by2"
  type: "Eltwise"
  bottom: "fuse_conv5_2_new_1by2"
  bottom: "conv5_3/out/pw_new_1by2"
  top: "fuse_conv5_3_new_1by2"
  eltwise_param {
    operation: SUM
  }
}
###############################################

layer {
  name: "conv6_1/in/pw_new_1by2"
  type: "Convolution"
  bottom: "fuse_conv5_3_new_1by2"
  top: "conv6_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6_1/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv6_1/in/pw_new_1by2"
  top: "conv6_1/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv6_1/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv6_1/in/pw_new_1by2"
  top: "conv6_1/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu6_1/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv6_1/in/pw_new_1by2"
  top: "conv6_1/in/pw_new_1by2"
}
layer {
  name: "conv6_1/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv6_1/in/pw_new_1by2"
  top: "conv6_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6_1/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv6_1/dw_new_1by2"
  top: "conv6_1/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv6_1/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv6_1/dw_new_1by2"
  top: "conv6_1/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu6_1/dw_new_1by2"
  type: "ReLU"
  bottom: "conv6_1/dw_new_1by2"
  top: "conv6_1/dw_new_1by2"
}
layer {
  name: "conv6_1/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv6_1/dw_new_1by2"
  top: "conv6_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6_1/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv6_1/out/pw_new_1by2"
  top: "conv6_1/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv6_1/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv6_1/out/pw_new_1by2"
  top: "conv6_1/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "conv6_2/in/pw_new_1by2"
  type: "Convolution"
  bottom: "conv6_1/out/pw_new_1by2"
  top: "conv6_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6_2/in/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv6_2/in/pw_new_1by2"
  top: "conv6_2/in/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv6_2/in/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv6_2/in/pw_new_1by2"
  top: "conv6_2/in/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu6_2/in/pw_new_1by2"
  type: "ReLU"
  bottom: "conv6_2/in/pw_new_1by2"
  top: "conv6_2/in/pw_new_1by2"
}
layer {
  name: "conv6_2/dw_new_1by2"
  type: "ConvolutionDepthwise"
  bottom: "conv6_2/in/pw_new_1by2"
  top: "conv6_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6_2/dw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv6_2/dw_new_1by2"
  top: "conv6_2/dw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv6_2/dw/scale_new_1by2"
  type: "Scale"
  bottom: "conv6_2/dw_new_1by2"
  top: "conv6_2/dw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "relu6_2/dw_new_1by2"
  type: "ReLU"
  bottom: "conv6_2/dw_new_1by2"
  top: "conv6_2/dw_new_1by2"
}
layer {
  name: "conv6_2/out/pw_new_1by2"
  type: "Convolution"
  bottom: "conv6_2/dw_new_1by2"
  top: "conv6_2/out/pw_new_1by2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    engine: CAFFE
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv6_2/out/pw/bn_new_1by2"
  type: "BatchNorm"
  bottom: "conv6_2/out/pw_new_1by2"
  top: "conv6_2/out/pw_new_1by2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "conv6_2/out/pw/scale_new_1by2"
  type: "Scale"
  bottom: "conv6_2/out/pw_new_1by2"
  top: "conv6_2/out/pw_new_1by2"
